package elstr

// japanese Hiragana list
// あ -- ん [:46]
// ぁ -- っ [46:55]
// が -- ぽ [55:]
var Hiragana = []rune{
	'あ', 'い', 'う', 'え', 'お',
	'か', 'き', 'く', 'け', 'こ',
	'さ', 'し', 'す', 'せ', 'そ',
	'た', 'ち', 'つ', 'て', 'と',
	'な', 'に', 'ぬ', 'ね', 'の',
	'は', 'ひ', 'ふ', 'へ', 'ほ',
	'ま', 'み', 'む', 'め', 'も',
	'や', 'ゆ', 'よ',
	'ら', 'り', 'る', 'れ', 'ろ',
	'わ', 'を',
	'ん',
	'ぁ', 'ぃ', 'ぅ', 'ぇ', 'ぉ',
	'ゃ', 'ゅ', 'ょ',
	'っ',
	'が', 'ぎ', 'ぐ', 'げ', 'ご',
	'ざ', 'じ', 'ず', 'ぜ', 'ぞ',
	'だ', 'ぢ', 'づ', 'で', 'ど',
	'ば', 'び', 'ぶ', 'べ', 'ぼ',
	'ぱ', 'ぴ', 'ぷ', 'ぺ', 'ぽ',
}

// japanese Katakana list
// ア -- ン [:46]
// ァ -- ッ [46:55]
// ガ -- ポ [55:]
var Katakana = []rune{
	'ア', 'イ', 'ウ', 'エ', 'オ',
	'カ', 'キ', 'ク', 'ケ', 'コ',
	'サ', 'シ', 'ス', 'セ', 'ソ',
	'タ', 'チ', 'ツ', 'テ', 'ト',
	'ナ', 'ニ', 'ヌ', 'ネ', 'ノ',
	'ハ', 'ヒ', 'フ', 'ヘ', 'ホ',
	'マ', 'ミ', 'ム', 'メ', 'モ',
	'ヤ', 'ユ', 'ヨ',
	'ラ', 'リ', 'ル', 'レ', 'ロ',
	'ワ', 'ヲ',
	'ン',
	'ァ', 'ィ', 'ゥ', 'ェ', 'ォ',
	'ャ', 'ュ', 'ョ',
	'ッ',
	'ガ', 'ギ', 'グ', 'ゲ', 'ゴ',
	'ザ', 'ジ', 'ズ', 'ゼ', 'ゾ',
	'ダ', 'ヂ', 'ヅ', 'デ', 'ド',
	'バ', 'ビ', 'ブ', 'ベ', 'ボ',
	'パ', 'ピ', 'プ', 'ペ', 'ポ',
}

// alphabet uppercase letter
var AlphabetUpper = []rune{
	'A', 'B', 'C', 'D', 'E', 'F', 'G',
	'H', 'I', 'J', 'K', 'L', 'M', 'N',
	'O', 'P', 'Q', 'R', 'S', 'T', 'U',
	'V', 'W', 'X', 'Y', 'Z',
}

// alphabet lowercase letter
var AlphabetLower = []rune{
	'a', 'b', 'c', 'd', 'e', 'f', 'g',
	'h', 'i', 'j', 'k', 'l', 'm', 'n',
	'o', 'p', 'q', 'r', 's', 't', 'u',
	'v', 'w', 'x', 'y', 'z',
}

// number list
var Number = []rune{'0', '1', '2', '3', '4', '5', '6', '7', '8', '9'}

// chinese number list
var ChineseDigitsTraditional = []rune{'零', '壹', '贰', '叁', '肆', '伍', '陆', '柒', '捌', '玖'}
var ChineseDigitsSimple = []rune{'〇', '一', '二', '三', '四', '五', '六', '七', '八', '九'}

// japanese number list
var JapaneseDigitsHiragana = []string{"いち", "に", "さん", "し", "ご", "ろく", "しち", "はち", "きゅう", "じゅう"}
var JapaneseDigitsKatakana = []string{"イチ", "ニ", "サン", "シ", "ゴ", "ロク", "シチ", "ハチ", "キュウ", "ジュウ"}
